export const FaqData = [
    {
        id: 0,
        title: "Какие способы оплаты доступны для пополнения счета и подключения подписки?",
        content: " Для пополнения счета вы можете использовать все доступные способы оплаты. Вы можете пополнить счет с помощью банковской карты, с помощью электронного кошелька, с помощью криптовалютного счета. В случае, если вам не подходитни один из вышеперечисленных способов оплаты - вы можете оплатить с помощью электронной кассы."
    },
    {
        id: 1,
        title: "Title 2",
        content: " Content 2"
    },
    {
        id: 2,
        title: "Title 3",
        content: " Content 3"
    },
    {
        id: 3,
        title: "Title 4",
        content: " Content 4"
    }
]