export const notifyData = [
    {
        id: 0,
        status: "inactive",
        title: "Аккаунт стал неактивным",
        text: "Внимание, один из ваших аккаунтов стал неактивным. Пожалуйста, добавьте новый аккаунт или проверьте предыдущий",
        date: "Вчера в 19:00"
    },
    {
        id: 1,
        status: "recommendation",
        title: "Необходимо обновить пароль",
        text: "Ваш пароль долго не обновлялся. Мы рекомендуем сменить его в ближайшее время.",
        date: "Вчера в 19:00"
    },
    {
        id: 2,
        status: "inactive",
        title: "Аккаунт стал неактивным",
        text: "Внимание, один из ваших аккаунтов стал неактивным. Пожалуйста, добавьте новый аккаунт или проверьте предыдущий",
        date: "Вчера в 19:00"
    },
    {
        id: 3,
        status: "recommendation",
        title: "Необходимо обновить пароль",
        text: "Ваш пароль долго не обновлялся. Мы рекомендуем сменить его в ближайшее время.",
        date: "Вчера в 19:00"
    },
    {
        id: 4,
        status: "inactive",
        title: "Аккаунт стал неактивным",
        text: "Внимание, один из ваших аккаунтов стал неактивным. Пожалуйста, добавьте новый аккаунт или проверьте предыдущий",
        date: "Вчера в 19:00"
    },
]